In [1]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

In [2]:
JaeminpgUrl = "postgresql://postgres:postgres@192.168.110.23:5432/postgres"

In [6]:
engine_pg = create_engine(JaeminpgUrl)

In [11]:
engine_pg

Engine(postgresql://postgres:***@192.168.110.23:5432/postgres)

In [ ]:
try:
    pd.read_sql(sql="select * from pg_out", con=engine_pg)
    print(192.168.110.23", connect succeed"+)
except

In [10]:
pd.read_sql(sql="select * from pg_out", con=engine_pg)

   REGIONID REGIONNAME
0       A00       아프리카
1       A01         미국
2       A02         한국
3       A03         독일
4       A04        브라질
..      ...        ...
68      A68      베네수엘라
69      A69        베트남
70      A70       바누아투
71      A71       None
72      A99         기타

[73 rows x 2 columns]

In [16]:
targetData = pd.read_csv("./hangul.csv", encoding="ms949")

In [17]:
targetData

   SALESID REGIONNAME
0      A00       아프리카
1      A01         미국
2      A02         한국
3      A03         독일
4      A04        브라질
..     ...        ...
68     A68      베네수엘라
69     A69        베트남
70     A70       바누아투
71     A71        NaN
72     A99         기타

[73 rows x 2 columns]

In [19]:
targetData.to_sql(name="carData",
            con=engine_pg,
           if_exists="replace", index=False)

TypeError: to_sql() got an unexpected keyword argument 'encoding'

In [20]:
mylocalpgUrl = "postgresql://postgres:postgres@127.0.0.1:5432/postgres"

In [21]:
myEngine_pg = create_engine(mylocalpgUrl)

In [22]:
pd.read_sql_table(table_name="pg_out", con=engine_pg)

   REGIONID REGIONNAME
0       A00       아프리카
1       A01         미국
2       A02         한국
3       A03         독일
4       A04        브라질
..      ...        ...
68      A68      베네수엘라
69      A69        베트남
70      A70       바누아투
71      A71       None
72      A99         기타

[73 rows x 2 columns]

In [ ]:
pg_out.columns = [""]